#+title: Bonk-evil
#+OPTIONS: toc:t
#+PROPERTY: header-args:emacs-lisp :tangle ./../core/bonk-evil.el :mkdirp yes

* Which key

[[https://github.com/justbur/emacs-which-key][which-key]] is a useful UI panel that appears when you start pressing any key binding in
Emacs to offer you all possible completions for the prefix.  For example, if you press =C-c=
(hold control and press the letter =c=), a panel will appear at the bottom of the frame
displaying all of the bindings under that prefix and which command they run.  This is very
useful for learning the possible key bindings in the mode of your current buffer.

#+begin_src emacs-lisp

  (setup (:pkg which-key :straight t)
    (diminish 'which-key-mode)
    (which-key-mode)
    (setq which-key-idle-delay 0.3))

#+end_src

#+RESULTS:
: 0.3

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-which-key"

#+end_src
